
{-
Дана строка, содержащая целое десятичное число. Определить, является ли это
число корректным номером банковской карты на основании алгоритма Луна.
-}

foo [] = False
foo lst = rem (sum (luna lst)) 10 == 0 where
  luna lst = luna' lst 1
  luna' [] n = []
  luna' (x : xs) n
    | n == 2 = x : luna' xs 1
    | otherwise = if x * 2 > 9
        then (x * 2 - 9) : luna' xs 2
        else (x * 2) : luna' xs 2

{-
  [4, 5, 6, 1, 2, 6, 1, 2, 1, 2, 3, 4, 5, 4, 6, 4] -> False
  [4, 5, 6, 1, 2, 6, 1, 2, 1, 2, 3, 4, 5, 4, 6, 7] -> True
-}