{-
Положения ферзей на шахматной доске заданы списком пар (горизонталь,
вертикаль). Определить, имеется ли пара ферзей, бьющих друг друга.
-}

foo [] = False
foo (x : xs) = check x xs || foo xs where 
  check p [] = False
  check p (x : xs)
    | fst p == fst x = True
    | snd p == snd x = True
    | abs (fst p - fst x) == abs (snd p - snd x) = True
    | otherwise = check p xs

{-
  [(1, 1), (2, 4), (5, 6), (8, 5)] -> False
  0 0 0 0 0 0 0 0
  0 0 0 0 0 0 0 0
  0 0 0 0 X 0 0 0
  0 0 0 0 0 0 0 X
  0 X 0 0 0 0 0 0
  0 0 0 0 0 0 0 0
  0 0 0 0 0 0 0 0
  X 0 0 0 0 0 0 0

  [(1, 2), (2, 4), (3, 7), (5, 5), (3, 5)] -> True
  0 0 0 0 0 0 0 0
  0 0 X 0 0 0 0 0
  0 0 0 0 0 0 0 0
  0 0 X 0 X 0 0 0
  0 X 0 0 0 0 0 0
  0 0 0 0 0 0 0 0
  X 0 0 0 0 0 0 0
  0 0 0 0 0 0 0 0
-}